---
title: ConduitSizeSettingIterator
classe: Autodesk.Revit.DB.Electrical.ConduitSizeSettingIterator
namespace: Autodesk.Revit.DB.Electrical
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# ConduitSizeSettingIterator

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `KeyValuePair<String, ConduitSizes> Current { get; }` | `conduitSizeSettingIterator.Current` | KeyValuePair<String, ConduitSizes> |
| `Boolean IsValidObject { get; }` | `conduitSizeSettingIterator.IsValidObject` | Boolean |
| `Void Dispose()` | `conduitSizeSettingIterator.Dispose()` | Void |
| `Boolean HasCurrent()` | `conduitSizeSettingIterator.HasCurrent()` | Boolean |
| `Boolean IsDone()` | `conduitSizeSettingIterator.IsDone()` | Boolean |
| `Boolean MoveNext()` | `conduitSizeSettingIterator.MoveNext()` | Boolean |
| `Void Reset()` | `conduitSizeSettingIterator.Reset()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```